[
    {
        
        "service_id": "04",
        "title": "Engine Oil Change",
        "img": "https://i.ibb.co/T2cpBd5/888.jpg",
        "price": "20.00",
        "description": "Keep your engine running smoothly with our premium oil change service. We use high-quality synthetic oils and replace filters to ensure maximum engine longevity and better fuel efficiency for your vehicle.",
        "facility": [
            {
                "name": "Premium Synthetic Oil",
                "details": "We use industry-leading lubricants to reduce engine wear and tear."
            },
            {
                "name": "Filter Replacement",
                "details": "Genuine oil filter replacement included to keep your engine clean."
            },
            {
                "name": "Quick Service",
                "details": "Our expert mechanics complete the process in under 30 minutes."
            },
            {
                "name": "Waste Disposal",
                "details": "Eco-friendly disposal of old oil following environmental safety standards."
            }
        ]
    },
    {
       
        "service_id": "05",
        "title": "Battery Charge & Health Check",
        "img": "https://i.ibb.co/ydCbDN3/5555.jpg",
        "price": "20.00",
        "description": "Don't get stranded with a dead battery. Our experts provide complete diagnostic testing, rapid charging, and terminal cleaning to ensure your car starts reliably every single time.",
        "facility": [
            {
                "name": "Voltage Testing",
                "details": "Accurate digital diagnostics to check your battery's current health."
            },
            {
                "name": "Rapid Charging",
                "details": "Safe and fast charging using professional-grade equipment."
            },
            {
                "name": "Corrosion Cleaning",
                "details": "Removal of acid buildup from terminals for better conductivity."
            },
            {
                "name": "Alternator Check",
                "details": "Ensuring your car's charging system is working perfectly."
            }
        ]
    },
    {
       
        "service_id": "01",
        "title": "Full Car Repair & Overhaul",
        "img": "https://i.ibb.co/R6Z2nFM/55.jpg",
        "price": "200.00",
        "description": "A comprehensive bumper-to-bumper repair service. Whether it's mechanical failure or structural issues, we restore your car to its factory condition using genuine parts and advanced machinery.",
        "facility": [
            {
                "name": "Genuine Spare Parts",
                "details": "We only use OEM (Original Equipment Manufacturer) parts for repairs."
            },
            {
                "name": "Computerized Diagnosis",
                "details": "Advanced scanning to find hidden mechanical or sensor issues."
            },
            {
                "name": "Expert Technicians",
                "details": "Certified mechanics with years of experience in luxury and local cars."
            },
            {
                "name": "Service Warranty",
                "details": "Get peace of mind with our 6-month warranty on all major repairs."
            }
        ]
    },
    {
      
        "service_id": "02",
        "title": "Engine Repair & Tuning",
        "img": "https://i.ibb.co/5MvmD2g/88.jpg",
        "price": "150.00",        "description": "Experience the true power of your vehicle. Our engine tuning and repair service optimizes performance, fixes overheating issues, and reduces abnormal engine noise for a quiet, powerful drive.",
        "facility": [
            {
                "name": "Performance Tuning",
                "details": "Fine-tuning the engine for better torque and horsepower."
            },
            {
                "name": "Leak Detection",
                "details": "Fixing oil, coolant, and fuel leaks using pressure testing."
            },
            {
                "name": "Carbon Cleaning",
                "details": "Removing internal carbon deposits for smoother acceleration."
            },
            {
                "name": "Belt & Chain Check",
                "details": "Inspecting timing belts and chains to prevent engine failure."
            }
        ]
    },
    {
       
        "service_id": "03",
        "title": "Automatic Transmission Service",
        "img": "https://i.ibb.co/wh7t3N3/555.jpg",
        "price": "30.00",
        "description": "Smooth gear shifts are essential for a comfortable ride. We provide specialized automatic transmission fluid (ATF) changes and gearbox health checks to prevent costly transmission failures.",
        "facility": [
            {
                "name": "Transmission Flush",
                "details": "Complete replacement of old fluid with high-grade ATF."
            },
            {
                "name": "Gearbox Diagnostics",
                "details": "Electronic scanning for shift delays or transmission slips."
            },
            {
                "name": "Clutch Adjustment",
                "details": "Ensuring smooth engagement between the engine and gearbox."
            },
            {
                "name": "Seal Inspection",
                "details": "Checking for minor leaks that could cause major gear damage."
            }
        ]
    },
    {
        
        "service_id": "06",
        "title": "Electrical System Repair",
        "img": "https://i.ibb.co/KzCG8qr/8888.jpg",
        "price": "20.00",
        "description": "From headlights to complex ECU wiring, we fix all electrical glitches. Our technicians use modern diagnostic tools to solve sensor issues, wiring shorts, and power window failures.",
        "facility": [
            {
                "name": "Wiring Diagnostics",
                "details": "Safe troubleshooting of complex car wiring systems."
            },
            {
                "name": "Light & Horn Fix",
                "details": "Repairing and upgrading headlights, fog lamps, and horns."
            },
            {
                "name": "Sensor Replacement",
                "details": "Replacing faulty ABS, Airbag, and Oxygen sensors."
            },
            {
                "name": "Dashboard Repair",
                "details": "Fixing digital clusters and infotainment system power issues."
            }
        ]
    }
]